// Написать программу нахождения произведения цифр заданного 7-значного числа.

Console.WriteLine("Введите k-значное число:");
int x = Convert.ToInt32(Console.ReadLine());

int a = 0;
int b = 0;
int c = 0;
int d =  0;
int e =  0;
int f =  0;
int j =  0;
int mul = 0;
if(x>999999&&x<10000000)
{
    a = x/1000000;
 b = x%1000000/100000;
 c = x%100000/10000;
 d =  x%10000/1000;
 e =  x%1000/100;
 f =  x%100/10;
 j =  x%10;
 mul = a*b*c*d*e*f;
    Console.WriteLine("Произведение цифр заданного 7-значного числа равно {0}", mul);
}

if(x>99999&&x<1000000)
{
   a = x/100000;
   b = x%100000/10000;
   c = x%10000/1000;
   d =  x%1000/100;
   e =  x%100/10;
   f =  x%10;
   mul = a*b*c*d*e*f;
   Console.WriteLine("Произведение цифр заданного 6-значного числа равно {0}", mul);
}

if(x>9999&&x<100000)
{
   a = x/10000;
   b = x%10000/1000;
   c = x%1000/100;
   d =  x%100/10;
   e =  x%10;
   mul = a*b*c*d*e;
    Console.WriteLine("Произведение цифр заданного 5-значного числа равно {0}", mul);
}

if(x>999&&x<10000)
{
   a = x/1000;
   b = x%1000/100;
   c = x%100/10;
   d =  x%10;
   mul = a*b*c*d;
   Console.WriteLine("Произведение цифр заданного 4-значного числа равно {0}", mul);
}

if(x>99&&x<1000)
{
   a = x/100;
   b = x%100/10;
   c = x%10;
   mul = a*b*c;
   Console.WriteLine("Произведение цифр заданного 3-значного числа равно {0}", mul);
}

if(x>9&&x<100)
{
   a = x/10;
   b = x%10;
   mul = a*b;
   Console.WriteLine("Произведение цифр заданного 2-значного числа равно {0}", mul);
}

if(x>0&&x<10)
{
   a = x;
   mul = a;
   Console.WriteLine("Произведение цифр заданного 1-значного числа равно {0}", mul);
}

if(x > 10000000)
{
    Console.WriteLine("Произведение цифр более длинных чисел совершать будем позже.");
}


